fireFoamCases/case3/case3_noGeometry/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0   0)	//0
    (125 0   0)	//1
    (125 20.9 0)	//2
    (0 20.9 0)	//3
    (0 0 23.94)	//4
    (125 0 23.94)	//5
    (125 20.9 23.94)	//6
    (0 20.9  23.94)	//7
    (250  0   0)	//8
    (250  20.9   0)	//9
    (250  0   23.94)	//10
    (250  20.9   23.94)	//11

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 60) simpleGrading (1 0.5 1)
    hex (1 8 9 2 5 10 11 6) (60 60 60) simpleGrading (1 0.5 1)
);

edges
(
);

boundary
(
    base
    {
        type patch;
        faces
        (
            (0 1 5 4)
	    (1 5 10 8)
        );
    }
    velocityInlet
    {
	type patch;
	faces
	(
	    (0 4 7 3)
	);
    }
    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
	    (2 9 11 6)
        );
    }
    sides
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            (0 1 2 3)
            //(1 5 6 2)
            (4 5 6 7)

	    (1 8 9 2)
	    (8 10 11 9)
	    (5 10 11 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
